# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, 
# если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

# *Пример:*

# 3 2 4 -> yes
# 3 2 1 -> no

n = int(input("количество долек: "))
m = int(input("количество долек: "))
k = int(input("сколько долек надо отломить: "))

if k<n*m:
    if  k%n ==0 or k%m ==0:
        print("можно")
    else :
        print("нельзя")
else :
    print("слишком много долек")